#ตัวอย่าง (ไปแก้ย่อหน้าเอาเอง)
print("กาลครั้งหนึ่งนานมาแล้วมีกระต่ายกับ.....")
print("1.ไก่")
print("2.หมา")
print("3.เต่า")
a1=int(input("1/2/3 : "))
if a1 == 1 :
    print("ไก่คุยกับกระต่ายไม่ได้")
    exit("จบ")
elif a1 == 2 :
    exit("หมากัดไก่ตายแล้ว คุณทำบ้าอะไรเนี่ย!!!")
elif a1== 3 :
    print("ทั้งสองตัวจึงวิ่งแข่งกัน")
    print("กระต่ายวิ่งไวมากๆ เต่าวิ่งไม่ทันเต่าจึงพูดขึ้นมาว่า........")
    print("1.รอด้วย")
    print("2.ชวนมาทำไมวะ")
    print("3.นิ่งไว!!!!")
    a2=int(input("1/2/3 : "))
    if a2 == 1 :
        print("กระต่ายไม่รอเต่าและยังวิ่งต่อไปจนเข้าเส้นชัย")
        exit("จบ")
    elif a2 == 2 :
        print("กระต่ายเกิดอาการฉุนที่เต่าไม่สุภาพจึงไปต่อยเต่าแต่เต่าไม่เป็นไรเพราะกระดองหนา")
        print("เต่าจึงหยิบ 9mm มาสอยกระต่ายไปที่ขมับ")
        exit("bad end")
    elif a2 == 3 :
        print("กระต่ายไม่ยอมหยุดจึงโดนโกโกวายิงตาย")
        exit("bad end")
    else :
        print("กรอกแค่ 1-3")

#กะเต่ากับกะต่าย
print("กาลครั้งหนึ่งนานมาแล้วมีกระต่ายกับ.....")
print("1.ไก่")
print("2.หมา")
print("3.เต่า")
a1=int(input("กรอกตัวเลือก(1,2,3): "))
while True:
    if a1 == 1 :
        print("ไก่คุยกับกระต่ายไม่ได้")
        a1=int(input("ใส่ตัวเลือกอีกครั้ง(1,2,3): "))
    if a1 == 2 :
        print("หมากัดไก่ตายแล้ว คุณทำบ้าอะไรเนี่ย!!!")
        a1=int(input("ใส่ตัวเลือกอีกครั้ง(1,2,3): "))
    if a1 == 3 :
        print("ทั้งสองตัวจึงวิ่งแข่งกัน")
        print("กระต่ายวิ่งไวมากๆ เต่าวิ่งไม่ทันเต่าจึงพูดขึ้นมาว่า........")
        print("1.รอด้วย")
        print("2.ชวนมาทำไมวะ")
        print("3.นิ่งไว!!!!")
        while True:
            a2=int(input())
            if a2 == 1 :
                print("กระต่ายไม่รอเต่าและยังวิ่งต่อไปจนเข้าเส้นชัย")
                exit("จบ")
            if a2 == 2 :
                print("กระต่ายเกิดอาการฉุรที่เต่าไม่สุภาพจึงไปต่อยเต่าแต่เต่าไม่เป็นไรเพราะกระดองหนา")
                print("เต่าจึงหยิบ 9mm มาสอยกระต่ายไปที่ขมับ")
                print("bad end")
            if a2 == 3 :
                print("กระต่ายไม่ยอมหยุดจึงโดนโกโกวายิงตาย")
                print("bad end")
            if a2 != 1 and 1 != 2 and 1 !=3 :
                print("กรอกแค่ 1-3")
                a1=int(input("ใส่ตัวเลือกอีกครั้ง"))
    if a1 != 1 and 1 != 2 and 1 !=3 :
        print("กรอกแค่ 1-3")
        a1=int(input("ใส่ตัวเลือกอีกครั้ง(1,2,3): "))